# CV第一章学习笔记

##机器学习、深度学习简介

*机器学习：通过算法使得机器能从大量历史数据中学习规律从而对新的样本做预测。如语音识别，构建一个函数，输入一段语音信号，输出一段文字；如图片识别，构
建一个函数，输入一张图片，输出该图片的识别结果
*深度学习是机器学习的子集，是基于神经网络的一种机器学习算法，主要有以下优势：
1) 深度神经网络在多个计算机视觉任务的比赛中获得了很好的成绩；
2) 深度神经网络模型可以用于不同的领域 (语言识别, 下围棋, 玩游戏, 预测比赛结果,计算机视觉等等)；
3) 在特定数据集特定任务上面超过普通人类的能力；
4) 活跃的社区, 大量的资源；
5) 计算机硬件软件技术的进步提供了技术能力支撑。

## 几种典型的深度神经网络结构
1) AlexNet（2012），共有 62378344 个权值 (250MB)，24 层。
2) VGGNet (2013)，102908520 个权值 (412MB)，23 层。
3) GoogLeNet(2014),6998552 个权值 (28MB)，143 层，首次提出了 Inception 的概念，主要贡献有两个：一是使用 1x1 的卷积来进行升降维；二是在多个尺寸上同时进行卷积再聚合，即提取了更多的信息。
4）ResNet (2015)，创造了 Residual 残差学习,152 层

## 深度学习在计算机视觉中的应用
* 深度学习在计算机视觉中主要有四个方面：图片分类（单目标），目标定位（单目标），目标检测（多目标），语义分割（多目标）。
*除此之外，还有压缩，Auto-encoders,，Self-organizing maps，生成图像描述 Image Captioning，结合递归神经网络 NLP，图像风格化转移 Image Stylization，基于内容的图像 Image Retrieval 等方面的应用
